//1. Когда выполняется любая команда в коде buttonSet 1 1 то тут же генерируется событие вида buttonSet1
//Функция сценариев проверяет есть ли в условиях сценариев такое событие.

//2. if (param_name == param) 

//param_name - из файла с вэб интерфейса

//param - из файла событий scenario_status

//если событие поступившее указано в сценариях, то выделяем знак sign и значение value 

//если значение value указанное в сценариях больше меньше ... равно ... значению текущему из файла прочтенному по заданному ключу то выполняем команды внутри
